package com.holyak.skhidnytsa.dummy;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;

public class SkhidnytsaImporter {
    public static List<SkhidnytsaItem> list = new ArrayList<>();

    static {
        SkhidnytsaItem item1 = new SkhidnytsaItem();
        item1.setContent("1");
        item1.setDetails("Мінеральна лікувальна вода типу «Нафтуся». Мінереалізація – 0,61 г/дм3.. Вживати за призначенням лікаря.\n" +
                "\n" +
                " - Вода має сечогінну дію, вимиває дрібні камені, пісок, слизь та гній з нирок.\n" +
                " - Підходить для лікування: сечокамянної хвороби, пієлонефриту, проблем з жовчно видільною системою.\n" +
                " - Знаходить при в’їзді в смт. Східниці зі строни Борислава, у лісі. З центральної дороги є вказівник до джерела.\n" +
                " - Поблизу: вілла «Золоте Руно» - 30 метрів, ЛОК «ДіАнна» - 400 метрів, ЛОК «Київська Русь» - 550 метрів, санаторій Стожари – 950 метрів.\n" +
                " - До найближчих джерел: джерело №8,9,10 – 550 метрів, джерело №3 – 900 метрів.");
        item1.setDiseases(Arrays.asList("Сечокам'яна хвороба", "Пієлонефрит", "проблем з жовчно видільною системою"));
        SkhidnytsaItem item2 = new SkhidnytsaItem();
        item2.setContent("1C");
        item2.setDetails("Мінеральна вода типу «Нафтуся». Мінералізація – 0,639 г/літр. Вживати за призначенням лікаря.\n" +
                "\n" +
                " - Лікарі рекомендують прийом води при цукровому діабеті, панкреатитах, хворобах сечовивідних шляхів, печінки.\n" +
                " - Знаходиться при в’їзді в смт. Східницю зі сторони Борислава, навпроти базару за мостом.\n" +
                " - Поблизу: ЛОК «3 сини та донька 4*» - 280 метрів, санаторій «Стожари» 300 метрів.\n" +
                " - До найближчих джерел: джерело №13 - 50 метрів, джерело №3 - 350 метрів.");
        item2.setDiseases(Arrays.asList("Цукровий діабет", "Панкреатит", "Хвороби печінки"));
        SkhidnytsaItem item3 = new SkhidnytsaItem();
        item3.setContent("8, 9, 10");
        item3.setDetails("Мінеральні води зібрані в одному бюветі слаболужного характеру, мають підвищений вміст кремнієвої кислоти, заліза, марганцю та срібла.\n" +
                "\n" +
                " - Прийом води сприяє збільшенню утворення жовчі та зменшенню рівня холестерину в організмі. Покращується сечовидільна та фільтраційна функція нирок.\n" +
                " - Вживають при захворюваннях печінки, жовчних шляхів, нирок, хронічних холецистит, жовчнокам’яній хворобі, хронічних гепатитах, сечокам’яній хворобі та пієлонефритах.\n" +
                " - Знаходиться на початку вулиці Шевченка,  неподалік від парку цілителя «Пантелеймона» та амфітеатру.\n" +
                " - Поблизу: ЛОК «Київська Русь» - 130 метрів, ЛОК «ДіАнна» - 350 метрів.");
        item3.setDiseases(Arrays.asList("Хвороби печінки", "Хронічний холесциту", "Жовтокам'яна хвороба", "Хронічий гастрит", "Сечокам'яна хвороба", "Пієлонефрит"));
        SkhidnytsaItem item4 = new SkhidnytsaItem();
        item4.setContent("2c");
        item4.setDetails("Мінеральна содова вода типу «Боржомі». Має підвищений вміст мікроелементів, йоду, брому, кремнієвої кислоти, органічних речовин.\n" +
                "\n" +
                " - Вода знижує кислотність шлункового соку.\n" +
                " - Рекомендують при захворюваннях шлунка, кишківника, дванадцятипалої кишки, хронічних панкреатитах, колітах, гастритах з нормальною та з підвищеною кислотністю, виразковій хворобі.\n" +
                " - Знаходиться в центрі смт. Східниця на вулиці Шевченка, біля автовокзалу.\n" +
                " - Поблизу: готель «Поезія Мандрів» - 40 метрів, ЛОК «Тустань» - 500 метрів, вілла «У Сестер» - 700 метрів.");
        item4.setDiseases(Arrays.asList("Захворювання шлунка", "Захворювання кишківника", "Хронічний панкреатит", "Хронічий гастрит", "Виразкова хвороба"));
        SkhidnytsaItem item5 = new SkhidnytsaItem();
        item5.setContent("15");
        item5.setDetails("Слабомінералізована вода типу «Залізиста». Збагачена залізом, марганцем та вуглекислотою, подібна за складом до джерела №13.\n" +
                "\n" +
                " - Сприяє виведенню радіонуклідів з організму.\n" +
                " - Рекомендують вживати при хронічних пієлонефритах, захворювання шлунка з пониженою кислотою, хронічних циститах, залізодефіцитній анемії.\n" +
                " - Знаходиться на території ландшафтного парку імені «Пантелеймона Цілителя».");
        item5.setDiseases(Arrays.asList("Пієлонефрит", "Захворювання шлунка", "Хронічний цистит", "Залідефіцитній анемії"));
        SkhidnytsaItem item6 = new SkhidnytsaItem();
        item6.setContent("5, 6");
        item6.setDetails("Мінеральна вода, яка має великий вміст органічних речовин та виражену жовчогінну дію.\n" +
                "\n" +
                " - Рекомендують при лікуванні сечокам’яної хвороби, хронічних захворюваннях сечовивідних та жовчовивідних шляхів. \n" +
                " - Знаходиться в лісовій зоні, біля готелю «Респект».\n");
        item6.setDiseases(Arrays.asList("Пієлонефрит", "Захворювання сечовивідних шляхів"));
        SkhidnytsaItem item7 = new SkhidnytsaItem();
        item7.setContent("18");
        item7.setDetails("Мінеральна вода, яка має великий вміст органічних речовин та виражену жовчогінну дію.\n" +
                "\n" +
                " - Має виражену жовчогінну дію, слабкий запах сірководню та підвищений вміст мікроелеметрів. \n" +
                " - Збільшує вироблення жовчі, стимулює регенерацію тканин печінки, знижує рівень та концентрацію холестерину в жовчі, знімає запальні процеси в нирках, підсилює водо видільну функцію нирок.\n" +
                " - Знаходиться на вулиці Івана Котляревського, поблизу музею О.Стоцького.\n" +
                " - Поблизу: вілла «Рай» - 170 метрів, готель «Цитадель»  та ЛОК «Санта Марія» - 210 метрів, вілла «Ксенія» - 270 метрів.");
        item7.setDiseases(Arrays.asList());
        SkhidnytsaItem item8 = new SkhidnytsaItem();
        item8.setContent("25, 26");
        item8.setDetails("Мінеральні води мають однаковий склад групи елементів характерних для вод типу «Нафтуся».\n" +
                "\n" +
                " - Мають виражену жовчогінну дію \n" +
                " - Застосовують при лікуваннях хронічних пієлонефритів, гастритів, холангітів, гепатитів, холециститів, сечокам’яній хворобі, літогенних діатезах, хронічних захворюваннях сечовивідних шляхів та нирок, після хвороби Боткіна та операцій на нирках.\n" +
                " - Знаходяться при виїзді зі смт. Східниця в сторону села Уріж, в лісовій зоні.\n" +
                " - Поблизу: ЛОК «Зелений Бір» - 400 метрів, вілла «Юран» - 600 метрів.");
        item8.setDiseases(Arrays.asList("Хвороба Боткіна","Хронічний панкреатит", "Холангіт", "Холецистит", "Літогенних діатезах", "Хвороба Боткіна", "Захворювання сечовивідних шляхів"));
        list.add(item1);
        list.add(item2);
        list.add(item3);
        list.add(item4);
        list.add(item5);
        list.add(item6);
        list.add(item7);
        list.add(item8);
    }

}
